# Rebar Bend Data Crank Angled Length 1 Property

Source: https://www.revitapidocs.com/2026/7f92235f-6dd6-e7b2-23e0-024a4a1302d5.htm

---

| Rebar Bend Data Crank Angled Length 1 Property |
| --- |

Identifies the crank angled length at the end.

The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CrankAngledLength1 { get; }
```

```
Public ReadOnly Property CrankAngledLength1 As Double
	Get
```

```
public:
property double CrankAngledLength1 {
	double get ();
}
```

```
member CrankAngledLength1 : float with get
```

#### Property Value

Double See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace